---
kind: type
id: T:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
source: html/5c7c33a6-8c2b-05e2-7088-3199f1a26e34.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs

The event arguments used by the ExternalDataInstanceRemovingFrom event.

## Syntax (C#)
```csharp
public class ExternalDataInstanceRemovingFromDocumentEventArgs : RevitAPIPreDocEventArgs
```